; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-95)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 car19 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc15)
    (at car1 loc4)
    (at car2 loc4)
    (at car3 loc14)
    (at car4 loc13)
    (at car5 loc10)
    (at car6 loc5)
    (at car7 loc10)
    (at car8 loc12)
    (at car9 loc3)
    (at car10 loc6)
    (at car11 loc3)
    (at car12 loc10)
    (at car13 loc5)
    (at car14 loc10)
    (at car15 loc11)
    (at car16 loc1)
    (at car17 loc2)
    (at car18 loc12)
    (at car19 loc11)
)
 (:goal (and 
(at car1 loc3)
(at car2 loc9)
(at car3 loc9)
(at car4 loc11)
(at car5 loc15)
(at car6 loc8)
(at car7 loc12)
(at car8 loc2)
(at car9 loc14)
(at car10 loc5)
))
)

; plan
1. (sail loc15 loc10)
   deleted: (at-ferry loc15)
   added: (at-ferry loc10)
   goals met: 0 of 10
2. (board car7 loc10)
   deleted: (at car7 loc10) (empty-ferry)
   added: (on car7)
   goals met: 0 of 10
3. (sail loc10 loc12)
   deleted: (at-ferry loc10)
   added: (at-ferry loc12)
   goals met: 0 of 10
4. (debark car7 loc12)
   deleted: (on car7)
   added: (at car7 loc12) (empty-ferry)
   goals met: 1 of 10
5. (board car8 loc12)
   deleted: (at car8 loc12) (empty-ferry)
   added: (on car8)
   goals met: 1 of 10
6. (sail loc12 loc2)
   deleted: (at-ferry loc12)
   added: (at-ferry loc2)
   goals met: 1 of 10
7. (debark car8 loc2)
   deleted: (on car8)
   added: (at car8 loc2) (empty-ferry)
   goals met: 2 of 10
8. (sail loc2 loc13)
   deleted: (at-ferry loc2)
   added: (at-ferry loc13)
   goals met: 2 of 10
9. (board car4 loc13)
   deleted: (at car4 loc13) (empty-ferry)
   added: (on car4)
   goals met: 2 of 10
10. (sail loc13 loc11)
   deleted: (at-ferry loc13)
   added: (at-ferry loc11)
   goals met: 2 of 10
11. (debark car4 loc11)
   deleted: (on car4)
   added: (at car4 loc11) (empty-ferry)
   goals met: 3 of 10
12. (sail loc11 loc6)
   deleted: (at-ferry loc11)
   added: (at-ferry loc6)
   goals met: 3 of 10
13. (board car10 loc6)
   deleted: (at car10 loc6) (empty-ferry)
   added: (on car10)
   goals met: 3 of 10
14. (sail loc6 loc5)
   deleted: (at-ferry loc6)
   added: (at-ferry loc5)
   goals met: 3 of 10
15. (debark car10 loc5)
   deleted: (on car10)
   added: (at car10 loc5) (empty-ferry)
   goals met: 4 of 10
16. (board car6 loc5)
   deleted: (at car6 loc5) (empty-ferry)
   added: (on car6)
   goals met: 4 of 10
17. (sail loc5 loc8)
   deleted: (at-ferry loc5)
   added: (at-ferry loc8)
   goals met: 4 of 10
18. (debark car6 loc8)
   deleted: (on car6)
   added: (at car6 loc8) (empty-ferry)
   goals met: 5 of 10
19. (sail loc8 loc4)
   deleted: (at-ferry loc8)
   added: (at-ferry loc4)
   goals met: 5 of 10
20. (board car1 loc4)
   deleted: (at car1 loc4) (empty-ferry)
   added: (on car1)
   goals met: 5 of 10
21. (sail loc4 loc3)
   deleted: (at-ferry loc4)
   added: (at-ferry loc3)
   goals met: 5 of 10
22. (debark car1 loc3)
   deleted: (on car1)
   added: (at car1 loc3) (empty-ferry)
   goals met: 6 of 10
23. (board car9 loc3)
   deleted: (at car9 loc3) (empty-ferry)
   added: (on car9)
   goals met: 6 of 10
24. (sail loc3 loc14)
   deleted: (at-ferry loc3)
   added: (at-ferry loc14)
   goals met: 6 of 10
25. (debark car9 loc14)
   deleted: (on car9)
   added: (at car9 loc14) (empty-ferry)
   goals met: 7 of 10
26. (board car3 loc14)
   deleted: (at car3 loc14) (empty-ferry)
   added: (on car3)
   goals met: 7 of 10
27. (sail loc14 loc9)
   deleted: (at-ferry loc14)
   added: (at-ferry loc9)
   goals met: 7 of 10
28. (debark car3 loc9)
   deleted: (on car3)
   added: (at car3 loc9) (empty-ferry)
   goals met: 8 of 10
29. (sail loc9 loc4)
   deleted: (at-ferry loc9)
   added: (at-ferry loc4)
   goals met: 8 of 10
30. (board car2 loc4)
   deleted: (at car2 loc4) (empty-ferry)
   added: (on car2)
   goals met: 8 of 10
31. (sail loc4 loc9)
   deleted: (at-ferry loc4)
   added: (at-ferry loc9)
   goals met: 8 of 10
32. (debark car2 loc9)
   deleted: (on car2)
   added: (at car2 loc9) (empty-ferry)
   goals met: 9 of 10
33. (sail loc9 loc10)
   deleted: (at-ferry loc9)
   added: (at-ferry loc10)
   goals met: 9 of 10
34. (board car5 loc10)
   deleted: (at car5 loc10) (empty-ferry)
   added: (on car5)
   goals met: 9 of 10
35. (sail loc10 loc15)
   deleted: (at-ferry loc10)
   added: (at-ferry loc15)
   goals met: 9 of 10
36. (debark car5 loc15)
   deleted: (on car5)
   added: (at car5 loc15) (empty-ferry)
   goals met: 10 of 10
